package com.skypro.animalShelterInfoBot.informationDirectory;

/**
 * Класс хранит временные данные для методов
 */
public class ShelterInformationDirectory {

    public static final String SHELTERADRESS = " г. Новосибирск, Советский район, ГСК Звезда ";

    public static final String WORKTIME = " пн-пт с 8-00 до 17-00 ";

    public static final String SHELTERINFO = """
             Телеграм бот, в котором ты можешь легко подобрать для себя лохматого друга!\s
            Сделать поиск по возрасту, окрасу, породе!
            А так же забронировать понравившегося и выбрать дату визита в приют!\s""";

    public static final String DOGHANDLERADVICE = """
            Вот какие советы дают профессиональные кинологи\s
            Перейдите по соответствующей ссылке, для прочтения статьи \uD83D\uDC47\s

            Статья для родителя щенков: https://hvost.news/animals/puppies-raising/s-chego-nachat-vospitanie-shchenka/\s
            Статья про интеллектуальные игры: https://hvost.news/animals/dogs-games/intellektualnye-igry-dlya-sobak-chto-eto-takoe-i-zachem-oni-nuzhny/\s
            Статья про ошибки воспитания собак: https://hvost.news/animals/puppies-raising/osnovnye-oshibki-pri-vospitanii-shchenka/\s
            """;

    public static final String HOMEFORCHILDPETS = """
            Как подготовить дом (квартиру) к появлению маленького питомца\s
            Перейдите по соответствующей ссылке, для прочтения статьи \uD83D\uDC47\s
            
            Обустройство жилья для щенка 🐶: https://hvost.news/animals/puppies-care/kak-podgotovit-dom-k-poyavleniyu-shchenka/\s
            Обустройство жилья для котенка 🐱 : https://hvost.news/animals/kittens-care/kak-podgotovit-dom-k-poyavleniyu-kotenka/\s
            """;

    public static final String CONTACTDOGHANDLERS = """
            Представляем лучших кинологов России\s
            Перейдите по соответствующей ссылке, для прочтения статьи \uD83D\uDC47\s
            
            Лучшие кинологи России 🐶: https://uslugi.yandex.ru/213-moscow/category?text=%D0%BB%D1%83%D1%87%D1%88%D0%B8%D0%B5+%D0%BA%D0%B8%D0%BD%D0%BE%D0%BB%D0%BE%D0%B3%D0%B8/\s
            """;
    public static final String REASONSFORREFUSAL = "Пожалуйста, свяжитесь с нами для получения дополнительной информации о причинах отказа. " +
            " Контакты администратора: 8-913-725-91-10";
    public static final String HOMEFORLIMITEDOPPORTUNITIES = """
            Как создать уютный дом для животного-инвалида\s
            Перейдите по соответствующей ссылке, для прочтения статьи \uD83D\uDC47\s
            
            Как облегчить жизнь животному-инвалиду 🐶: https://petscage.ru/blog/kak-oblegchit-zhizn-zhivotnomu-invalidu/\s
            """;
    public static final String HOMEFORADULTS = """
            Не бойтесь брать взрослых животных\s
            Перейдите по соответствующей ссылке, для прочтения статьи \uD83D\uDC47\s
            
            Советы по уходу за взрослыми животными 🐶: https://poteriashki.ru/static.php?sid=14&ssid=22\s
            """;
    public static final String RECOMMENDATIONTRANSPORTANIMAL = """
            Мы можем порекомендовать транспортные услуги для вашего нового питомца.\s
            Перейдите по соответствующей ссылке, для прочтения статьи \uD83D\uDC47\s
            
            Перевозка животных по всему миру 🐶: https://animals-travel.ru/\s
            """;
    public static final String LISTSDOCSDECOR = """
            Основные условия усыновления. \s
            Перейдите по соответствующей ссылке, для прочтения статьи \uD83D\uDC47\s
            
            Условия усыновления : https://zovpredkov.net/kak-vzyat-sobaku-iz-priyuta/\s
            """;

    public static final String TBSHELTER = """
            Основные правила нахождения на территории приюта.\s
            Перейдите по соответствующей ссылке ниже, для прочтения \uD83D\uDC47\s
            
            ТБ на территории приюта : https://baikalvet.com/index.php/uslugi/priyut-dlya-koshek-i-sobak/uslugi-3""";

    public static final String MEETINGANIMALS = """
            С чего начинать знакомство с новым другом:\s
            Перейдите по соответствующей ссылке ниже, для прочтения \uD83D\uDC47\s

            Как знакомиться с собакой 🐶 : https://adoption.pedigree.ru/articles/kak-pravilno-vybrat-sobaku-v-priyute\s
            Как знакомиться с кошкой 🐱 : https://pets.mail.ru/how-to/pervoe-vpechatlenie-pervoe-znakomstvo-s-koshkoj/""";

    public static final String REGISTERPASS = """
            Свяжитесь с охраной для регистрации пропуска на территорию приюта \uD83D\uDC6E\u200D♂️\s

            ФИО: Иванов Иван Иванович\s
            Телефон: 7-390-517-00-00\s
            Email: vasya.security@shelter.ru\s
            """;

    public static final String LEAVECONTACT = """
            Пожалуйста, оставьте вашу контактную информацию, чтобы мы могли связаться с вами.
            Отправте контакты в формате XXX-XXX-XX-XX test@gmail.com
            """;

    public static final String REPLYTOCONTACT = "Контактные данные успешно сохранены!\n" +
            "В ближайшее время с вами свяжутся наши специалисты.";

    public static final String NOTFOUNDTEXT = """
            Я не разобрал ваше сообщение, попробуйте еще раз или\s
            Выберите интересующую вас кнопку меню \uD83D\uDC47\s
            Или воспользуйтесь кнопкой вызова волонтера, он вам поможет \uD83D\uDE09""";


}
